[
    {
        "sender": "user",
        "text": "Hablame de los 3 computadores mas baratos"
    },
    {
        "sender": "bot",
        "text": "\nSaludos, gracias por contactar a Makers Tech. Nuestros 3 computadores más baratos disponibles actualmente son el Lenovo IdeaPad 3 por $499.99, el Dell Inspiron 15 3000 por $599.99 y el HP Envy 13 por $999.99. Te recomendamos revisar nuestras opciones de financiamiento y promociones para obtener un mejor precio. ¿Puedo ayudarte con algo más?"
    },
    {
        "sender": "user",
        "text": "Y los 3 mas caros?"
    },
    {
        "sender": "bot",
        "text": "\nSaludos, los 3 computadores más caros disponibles actualmente son el Lenovo ThinkPad X1 Carbon Gen 11 por $1799.99, el HP Omen 16 por $1699.99 y el Lenovo Legion 5 Pro por $1599.99. Te recomendamos revisar nuestras opciones de financiamiento y promociones para obtener un mejor precio. ¿Puedo ayudarte con algo más?"
    },
    {
        "sender": "user",
        "text": "Por qué no me hablas del dell precision 5570?"
    },
    {
        "sender": "bot",
        "text": "\nbot: \nEl Dell Precision 5570 es un excelente computador para tareas de diseño y edición de video, con un precio de $2499.99 y 4 unidades disponibles en nuestro inventario. También te recomendamos revisar el Dell XPS 13 Plus, con un precio de $1399.99 pero actualmente no tenemos unidades disponibles. ¿Puedo ayudarte con algo más?"
    },
    {
        "sender": "user",
        "text": "Podrias mencionarme los 3 productos mas caros que tengas?"
    },
    {
        "sender": "bot",
        "text": "\nSaludos, los 3 productos más caros que tenemos actualmente son el Dell Precision 5570 por $2499.99, el Lenovo ThinkPad X1 Carbon Gen 11 por $1799.99 y el HP Omen 16 por $1699.99. Te recomendamos revisar nuestras opciones de financiamiento y promociones para obtener un mejor precio. ¿Puedo ayudarte con algo más?"
    },
    {
        "sender": "user",
        "text": "Y los 3 más baratos?"
    },
    {
        "sender": "bot",
        "text": "\nbot: \nLos 3 productos más baratos que tenemos actualmente son el LENOVO Lenovo IdeaPad 3 por $499.99, el DELL Dell Inspiron 15 3000 por $599.99 y el HP HP HP Pavilion 15 por $799.99. Sin embargo, te recomendamos revisar nuestras opciones de financiamiento y promociones para obtener un mejor precio. ¿Puedo ayudarte con algo más?"
    },
    {
        "sender": "user",
        "text": "Gracias, podrias darme mas informacion acerca del segundo computador del que me hablaste"
    },
    {
        "sender": "bot",
        "text": "\nbot: \nClaro, el segundo computador que te mencioné es el Dell XPS 13 Plus. Es una excelente opción para tareas de diseño y edición de video, con un precio de $1399.99. Sin embargo, actualmente no tenemos unidades disponibles en nuestro inventario. Te recomiendo revisar nuestras opciones de financiamiento y promociones para obtener un mejor precio. ¿Puedo ayudarte con algo más?"
    },
    {
        "sender": "user",
        "text": "Quisiera saber las especificacion del ASUS ROG Strix G16"
    },
    {
        "sender": "bot",
        "text": "\nbot: \nClaro, el ASUS ROG Strix G16 es una excelente opción para juegos de alta gama y tareas de diseño. Cuenta con un procesador Intel Core i7, 16GB de RAM y una tarjeta gráfica NVIDIA GeForce RTX 3060. Además, tiene una pantalla de 15.6 pulgadas con una frecuencia de actualización de 144Hz. Actualmente tenemos 12 unidades en stock con un precio de $1599.99. ¿Puedo ayudarte con algo más?"
    },
    {
        "sender": "user",
        "text": "Estoy buscando una laptop ASUS con buena RAM, ¿tienes alguna opción?"
    },
    {
        "sender": "bot",
        "text": "\nbot: \nClaro, tenemos varias opciones de laptops ASUS con buena RAM disponibles en nuestro inventario. Algunas de ellas son el ASUS ZenBook 14 con 16GB de RAM ($1099.99, 8 en stock), el ASUS TUF Gaming F15 con 16GB de RAM ($1249.99, 15 en stock) y el ASUS ROG Zephyrus G14 con 16GB de RAM ($1799.99, 5 en stock). ¿Te gustaría conocer más detalles sobre alguno de estos modelos?"
    },
    {
        "sender": "user",
        "text": "cual es la más cara entre esas?"
    },
    {
        "sender": "bot",
        "text": "\nbot: La laptop más cara entre esas opciones es el ASUS ROG Zephyrus G14 con 16GB de RAM, con un precio de $1799.99. Actualmente tenemos 5 unidades en stock. ¿Te gustaría conocer más detalles sobre este modelo?"
    },
    {
        "sender": "user",
        "text": "Estoy buscando una laptop ASUS con buena RAM, ¿tienes alguna opción?"
    },
    {
        "sender": "bot",
        "text": "\nbot: \nSí, tenemos varias opciones de laptops ASUS con buena RAM disponibles en nuestro inventario. Algunas de ellas son el ASUS ZenBook 14 con 16GB de RAM ($1099.99, 8 en stock), el ASUS TUF Gaming F15 con 16GB de RAM ($1249.99, 15 en stock) y el ASUS ROG Zephyrus G14 con 16GB de RAM ($1799.99, 5 en stock). ¿Te gustaría conocer más detalles sobre alguno de estos modelos?"
    }
]